#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaCompendiumTab

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function AthenaCompendiumTab.AthenaCompendiumTab_C.ExecuteUbergraph_AthenaCompendiumTab
// 0x0028 (0x0028 - 0x0000)
struct AthenaCompendiumTab_C_ExecuteUbergraph_AthenaCompendiumTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_TabId2;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_TabId;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCompendiumTab_C_ExecuteUbergraph_AthenaCompendiumTab) == 0x000008, "Wrong alignment on AthenaCompendiumTab_C_ExecuteUbergraph_AthenaCompendiumTab");
static_assert(sizeof(AthenaCompendiumTab_C_ExecuteUbergraph_AthenaCompendiumTab) == 0x000028, "Wrong size on AthenaCompendiumTab_C_ExecuteUbergraph_AthenaCompendiumTab");
static_assert(offsetof(AthenaCompendiumTab_C_ExecuteUbergraph_AthenaCompendiumTab, EntryPoint) == 0x000000, "Member 'AthenaCompendiumTab_C_ExecuteUbergraph_AthenaCompendiumTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_ExecuteUbergraph_AthenaCompendiumTab, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaCompendiumTab_C_ExecuteUbergraph_AthenaCompendiumTab::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_ExecuteUbergraph_AthenaCompendiumTab, K2Node_ComponentBoundEvent_TabId2) == 0x000010, "Member 'AthenaCompendiumTab_C_ExecuteUbergraph_AthenaCompendiumTab::K2Node_ComponentBoundEvent_TabId2' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_ExecuteUbergraph_AthenaCompendiumTab, K2Node_ComponentBoundEvent_TabId) == 0x000018, "Member 'AthenaCompendiumTab_C_ExecuteUbergraph_AthenaCompendiumTab::K2Node_ComponentBoundEvent_TabId' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_ExecuteUbergraph_AthenaCompendiumTab, K2Node_ComponentBoundEvent_TabButton) == 0x000020, "Member 'AthenaCompendiumTab_C_ExecuteUbergraph_AthenaCompendiumTab::K2Node_ComponentBoundEvent_TabButton' has a wrong offset!");

// Function AthenaCompendiumTab.AthenaCompendiumTab_C.BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_56_OnTabButtonCreated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct AthenaCompendiumTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_56_OnTabButtonCreated__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCompendiumTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_56_OnTabButtonCreated__DelegateSignature) == 0x000008, "Wrong alignment on AthenaCompendiumTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_56_OnTabButtonCreated__DelegateSignature");
static_assert(sizeof(AthenaCompendiumTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_56_OnTabButtonCreated__DelegateSignature) == 0x000010, "Wrong size on AthenaCompendiumTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_56_OnTabButtonCreated__DelegateSignature");
static_assert(offsetof(AthenaCompendiumTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_56_OnTabButtonCreated__DelegateSignature, TabId) == 0x000000, "Member 'AthenaCompendiumTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_56_OnTabButtonCreated__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_56_OnTabButtonCreated__DelegateSignature, TabButton) == 0x000008, "Member 'AthenaCompendiumTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_56_OnTabButtonCreated__DelegateSignature::TabButton' has a wrong offset!");

// Function AthenaCompendiumTab.AthenaCompendiumTab_C.BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_45_OnTabSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) AthenaCompendiumTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_45_OnTabSelected__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCompendiumTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_45_OnTabSelected__DelegateSignature) == 0x000008, "Wrong alignment on AthenaCompendiumTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_45_OnTabSelected__DelegateSignature");
static_assert(sizeof(AthenaCompendiumTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_45_OnTabSelected__DelegateSignature) == 0x000008, "Wrong size on AthenaCompendiumTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_45_OnTabSelected__DelegateSignature");
static_assert(offsetof(AthenaCompendiumTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_45_OnTabSelected__DelegateSignature, TabId) == 0x000000, "Member 'AthenaCompendiumTab_C_BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_45_OnTabSelected__DelegateSignature::TabId' has a wrong offset!");

// Function AthenaCompendiumTab.AthenaCompendiumTab_C.RegisterEventListeners
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) AthenaCompendiumTab_C_RegisterEventListeners final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaCompendiumTab_C_RegisterEventListeners) == 0x000008, "Wrong alignment on AthenaCompendiumTab_C_RegisterEventListeners");
static_assert(sizeof(AthenaCompendiumTab_C_RegisterEventListeners) == 0x000010, "Wrong size on AthenaCompendiumTab_C_RegisterEventListeners");
static_assert(offsetof(AthenaCompendiumTab_C_RegisterEventListeners, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaCompendiumTab_C_RegisterEventListeners::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function AthenaCompendiumTab.AthenaCompendiumTab_C.UpdateCompendiumViews
// 0x0090 (0x0090 - 0x0000)
struct AthenaCompendiumTab_C_UpdateCompendiumViews final
{
public:
	TArray<class UFortCompendiumBundle*>          CompendiumBundles;                                 // 0x0000(0x0010)(Edit, ZeroConstructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCompendiumBundleDefinition*        CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCompendiumBundleUpsellPage_C*          CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortCompendiumBundle*                  CallFunc_Array_Get_Item2;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortCompendiumBundleDefinition*        CallFunc_GetCompendiumBundleDefinitionBP_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue2;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCompendiumBundle_C*                    CallFunc_Create_ReturnValue2;                      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortCompendiumBundle*>          CallFunc_GetCompendiumBundles_OutActiveBundles;    // 0x0070(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UFortCompendiumBundleDefinition*> CallFunc_GetCompendiumBundles_OutUnlockableBundles; // 0x0080(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(AthenaCompendiumTab_C_UpdateCompendiumViews) == 0x000008, "Wrong alignment on AthenaCompendiumTab_C_UpdateCompendiumViews");
static_assert(sizeof(AthenaCompendiumTab_C_UpdateCompendiumViews) == 0x000090, "Wrong size on AthenaCompendiumTab_C_UpdateCompendiumViews");
static_assert(offsetof(AthenaCompendiumTab_C_UpdateCompendiumViews, CompendiumBundles) == 0x000000, "Member 'AthenaCompendiumTab_C_UpdateCompendiumViews::CompendiumBundles' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_UpdateCompendiumViews, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'AthenaCompendiumTab_C_UpdateCompendiumViews::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_UpdateCompendiumViews, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'AthenaCompendiumTab_C_UpdateCompendiumViews::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_UpdateCompendiumViews, Temp_int_Array_Index_Variable) == 0x000018, "Member 'AthenaCompendiumTab_C_UpdateCompendiumViews::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_UpdateCompendiumViews, Temp_int_Array_Index_Variable2) == 0x00001C, "Member 'AthenaCompendiumTab_C_UpdateCompendiumViews::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_UpdateCompendiumViews, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'AthenaCompendiumTab_C_UpdateCompendiumViews::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_UpdateCompendiumViews, CallFunc_Array_Get_Item) == 0x000028, "Member 'AthenaCompendiumTab_C_UpdateCompendiumViews::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_UpdateCompendiumViews, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'AthenaCompendiumTab_C_UpdateCompendiumViews::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_UpdateCompendiumViews, CallFunc_Create_ReturnValue) == 0x000038, "Member 'AthenaCompendiumTab_C_UpdateCompendiumViews::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_UpdateCompendiumViews, CallFunc_Array_Get_Item2) == 0x000040, "Member 'AthenaCompendiumTab_C_UpdateCompendiumViews::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_UpdateCompendiumViews, CallFunc_GetCompendiumBundleDefinitionBP_ReturnValue) == 0x000048, "Member 'AthenaCompendiumTab_C_UpdateCompendiumViews::CallFunc_GetCompendiumBundleDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_UpdateCompendiumViews, CallFunc_Array_Length_ReturnValue2) == 0x000050, "Member 'AthenaCompendiumTab_C_UpdateCompendiumViews::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_UpdateCompendiumViews, Temp_int_Loop_Counter_Variable2) == 0x000054, "Member 'AthenaCompendiumTab_C_UpdateCompendiumViews::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_UpdateCompendiumViews, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'AthenaCompendiumTab_C_UpdateCompendiumViews::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_UpdateCompendiumViews, CallFunc_Less_IntInt_ReturnValue2) == 0x000059, "Member 'AthenaCompendiumTab_C_UpdateCompendiumViews::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_UpdateCompendiumViews, CallFunc_Add_IntInt_ReturnValue2) == 0x00005C, "Member 'AthenaCompendiumTab_C_UpdateCompendiumViews::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_UpdateCompendiumViews, CallFunc_GetOwningPlayer_ReturnValue2) == 0x000060, "Member 'AthenaCompendiumTab_C_UpdateCompendiumViews::CallFunc_GetOwningPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_UpdateCompendiumViews, CallFunc_Create_ReturnValue2) == 0x000068, "Member 'AthenaCompendiumTab_C_UpdateCompendiumViews::CallFunc_Create_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_UpdateCompendiumViews, CallFunc_GetCompendiumBundles_OutActiveBundles) == 0x000070, "Member 'AthenaCompendiumTab_C_UpdateCompendiumViews::CallFunc_GetCompendiumBundles_OutActiveBundles' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_UpdateCompendiumViews, CallFunc_GetCompendiumBundles_OutUnlockableBundles) == 0x000080, "Member 'AthenaCompendiumTab_C_UpdateCompendiumViews::CallFunc_GetCompendiumBundles_OutUnlockableBundles' has a wrong offset!");

// Function AthenaCompendiumTab.AthenaCompendiumTab_C.CreateTab
// 0x00F8 (0x00F8 - 0x0000)
struct AthenaCompendiumTab_C_CreateTab final
{
public:
	class UFortCompendiumBundleDefinition*        CompendiumBundleDefinition;                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                ContentWidget;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0018)()
	class FString                                 CallFunc_GetPersistentName_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFortTabButtonLabelInfo                K2Node_MakeStruct_FortTabButtonLabelInfo;          // 0x0038(0x00A8)()
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RegisterFortTab_ReturnValue;              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCompendiumTab_C_CreateTab) == 0x000008, "Wrong alignment on AthenaCompendiumTab_C_CreateTab");
static_assert(sizeof(AthenaCompendiumTab_C_CreateTab) == 0x0000F8, "Wrong size on AthenaCompendiumTab_C_CreateTab");
static_assert(offsetof(AthenaCompendiumTab_C_CreateTab, CompendiumBundleDefinition) == 0x000000, "Member 'AthenaCompendiumTab_C_CreateTab::CompendiumBundleDefinition' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_CreateTab, ContentWidget) == 0x000008, "Member 'AthenaCompendiumTab_C_CreateTab::ContentWidget' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_CreateTab, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'AthenaCompendiumTab_C_CreateTab::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_CreateTab, CallFunc_GetPersistentName_ReturnValue) == 0x000028, "Member 'AthenaCompendiumTab_C_CreateTab::CallFunc_GetPersistentName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_CreateTab, K2Node_MakeStruct_FortTabButtonLabelInfo) == 0x000038, "Member 'AthenaCompendiumTab_C_CreateTab::K2Node_MakeStruct_FortTabButtonLabelInfo' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_CreateTab, CallFunc_Conv_StringToName_ReturnValue) == 0x0000E0, "Member 'AthenaCompendiumTab_C_CreateTab::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_CreateTab, CallFunc_RegisterFortTab_ReturnValue) == 0x0000E8, "Member 'AthenaCompendiumTab_C_CreateTab::CallFunc_RegisterFortTab_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_CreateTab, CallFunc_AddChild_ReturnValue) == 0x0000F0, "Member 'AthenaCompendiumTab_C_CreateTab::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function AthenaCompendiumTab.AthenaCompendiumTab_C.HandleTabSelected
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) AthenaCompendiumTab_C_HandleTabSelected final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActiveTab_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCompendiumTab_C_HandleTabSelected) == 0x000008, "Wrong alignment on AthenaCompendiumTab_C_HandleTabSelected");
static_assert(sizeof(AthenaCompendiumTab_C_HandleTabSelected) == 0x000010, "Wrong size on AthenaCompendiumTab_C_HandleTabSelected");
static_assert(offsetof(AthenaCompendiumTab_C_HandleTabSelected, TabId) == 0x000000, "Member 'AthenaCompendiumTab_C_HandleTabSelected::TabId' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_HandleTabSelected, CallFunc_GetActiveTab_ReturnValue) == 0x000008, "Member 'AthenaCompendiumTab_C_HandleTabSelected::CallFunc_GetActiveTab_ReturnValue' has a wrong offset!");

// Function AthenaCompendiumTab.AthenaCompendiumTab_C.HandleTabButtonCreated
// 0x0048 (0x0048 - 0x0000)
struct AthenaCompendiumTab_C_HandleTabButtonCreated final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          Button;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          LocalTab;                                          // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LocalTabId;                                        // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconTabButton_C*                       K2Node_DynamicCast_AsIcon_Tab_Button;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0030(0x0018)()
};
static_assert(alignof(AthenaCompendiumTab_C_HandleTabButtonCreated) == 0x000008, "Wrong alignment on AthenaCompendiumTab_C_HandleTabButtonCreated");
static_assert(sizeof(AthenaCompendiumTab_C_HandleTabButtonCreated) == 0x000048, "Wrong size on AthenaCompendiumTab_C_HandleTabButtonCreated");
static_assert(offsetof(AthenaCompendiumTab_C_HandleTabButtonCreated, TabId) == 0x000000, "Member 'AthenaCompendiumTab_C_HandleTabButtonCreated::TabId' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_HandleTabButtonCreated, Button) == 0x000008, "Member 'AthenaCompendiumTab_C_HandleTabButtonCreated::Button' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_HandleTabButtonCreated, LocalTab) == 0x000010, "Member 'AthenaCompendiumTab_C_HandleTabButtonCreated::LocalTab' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_HandleTabButtonCreated, LocalTabId) == 0x000018, "Member 'AthenaCompendiumTab_C_HandleTabButtonCreated::LocalTabId' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_HandleTabButtonCreated, K2Node_DynamicCast_AsIcon_Tab_Button) == 0x000020, "Member 'AthenaCompendiumTab_C_HandleTabButtonCreated::K2Node_DynamicCast_AsIcon_Tab_Button' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_HandleTabButtonCreated, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AthenaCompendiumTab_C_HandleTabButtonCreated::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaCompendiumTab_C_HandleTabButtonCreated, CallFunc_TextToUpper_ReturnValue) == 0x000030, "Member 'AthenaCompendiumTab_C_HandleTabButtonCreated::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

}

