#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaCompendiumTab

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaCompendiumTab.AthenaCompendiumTab_C
// 0x0040 (0x0460 - 0x0420)
class UAthenaCompendiumTab_C final : public UAthenaCompendiumScreenBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(Transient, DuplicateTransient)
	class UHorizontalTabList_C*                   CompendiumBundleTabList;                           // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CompendiumSwitcher;                                // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UFortCompendiumBundleDefinition*> UnlockableBundles;                                 // 0x0438(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UFortCompendiumBundle*>          ActiveBundles;                                     // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FName                                   LastActiveTab;                                     // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaCompendiumTab(int32 EntryPoint);
	void BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_56_OnTabButtonCreated__DelegateSignature(class FName TabId, class UCommonButton* TabButton);
	void BndEvt__CompendiumBundleTabList_K2Node_ComponentBoundEvent_45_OnTabSelected__DelegateSignature(class FName TabId);
	void OnDeactivated();
	void OnActivated();
	void Construct();
	void RegisterEventListeners();
	void HandleCompendiumChanged();
	void UpdateCompendiumViews();
	void CreateTab(class UFortCompendiumBundleDefinition* CompendiumBundleDefinition, class UWidget* ContentWidget);
	void ResetTabs();
	void HandleTabSelected(class FName TabId);
	void HandleTabButtonCreated(class FName TabId, class UCommonButton* Button);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaCompendiumTab_C">();
	}
	static class UAthenaCompendiumTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCompendiumTab_C>();
	}
};
static_assert(alignof(UAthenaCompendiumTab_C) == 0x000008, "Wrong alignment on UAthenaCompendiumTab_C");
static_assert(sizeof(UAthenaCompendiumTab_C) == 0x000460, "Wrong size on UAthenaCompendiumTab_C");
static_assert(offsetof(UAthenaCompendiumTab_C, UberGraphFrame) == 0x000420, "Member 'UAthenaCompendiumTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaCompendiumTab_C, CompendiumBundleTabList) == 0x000428, "Member 'UAthenaCompendiumTab_C::CompendiumBundleTabList' has a wrong offset!");
static_assert(offsetof(UAthenaCompendiumTab_C, CompendiumSwitcher) == 0x000430, "Member 'UAthenaCompendiumTab_C::CompendiumSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaCompendiumTab_C, UnlockableBundles) == 0x000438, "Member 'UAthenaCompendiumTab_C::UnlockableBundles' has a wrong offset!");
static_assert(offsetof(UAthenaCompendiumTab_C, ActiveBundles) == 0x000448, "Member 'UAthenaCompendiumTab_C::ActiveBundles' has a wrong offset!");
static_assert(offsetof(UAthenaCompendiumTab_C, LastActiveTab) == 0x000458, "Member 'UAthenaCompendiumTab_C::LastActiveTab' has a wrong offset!");

}

