#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaWinWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaWinWidget.AthenaWinWidget_C.ExecuteUbergraph_AthenaWinWidget
// 0x0068 (0x0068 - 0x0000)
struct AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 NumHighlights)>          K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue2;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget) == 0x000008, "Wrong alignment on AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget");
static_assert(sizeof(AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget) == 0x000068, "Wrong size on AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget");
static_assert(offsetof(AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget, EntryPoint) == 0x000000, "Member 'AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget, K2Node_ComponentBoundEvent_Button2) == 0x000018, "Member 'AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000028, "Member 'AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget, CallFunc_GetUINavigationManager_ReturnValue) == 0x000038, "Member 'AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget, K2Node_ComponentBoundEvent_Button) == 0x000040, "Member 'AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget, CallFunc_GetOwningPlayer_ReturnValue2) == 0x000048, "Member 'AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget::CallFunc_GetOwningPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget, CallFunc_GetContext_ReturnValue) == 0x000050, "Member 'AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000058, "Member 'AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget, K2Node_DynamicCast_bSuccess2) == 0x000060, "Member 'AthenaWinWidget_C_ExecuteUbergraph_AthenaWinWidget::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

// Function AthenaWinWidget.AthenaWinWidget_C.BndEvt__OpenShadowPlayHighlights_K2Node_ComponentBoundEvent_59_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaWinWidget_C_BndEvt__OpenShadowPlayHighlights_K2Node_ComponentBoundEvent_59_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaWinWidget_C_BndEvt__OpenShadowPlayHighlights_K2Node_ComponentBoundEvent_59_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaWinWidget_C_BndEvt__OpenShadowPlayHighlights_K2Node_ComponentBoundEvent_59_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaWinWidget_C_BndEvt__OpenShadowPlayHighlights_K2Node_ComponentBoundEvent_59_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaWinWidget_C_BndEvt__OpenShadowPlayHighlights_K2Node_ComponentBoundEvent_59_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaWinWidget_C_BndEvt__OpenShadowPlayHighlights_K2Node_ComponentBoundEvent_59_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaWinWidget_C_BndEvt__OpenShadowPlayHighlights_K2Node_ComponentBoundEvent_59_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaWinWidget.AthenaWinWidget_C.BndEvt__LeaveButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaWinWidget_C_BndEvt__LeaveButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaWinWidget_C_BndEvt__LeaveButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaWinWidget_C_BndEvt__LeaveButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaWinWidget_C_BndEvt__LeaveButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaWinWidget_C_BndEvt__LeaveButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaWinWidget_C_BndEvt__LeaveButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaWinWidget_C_BndEvt__LeaveButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaWinWidget.AthenaWinWidget_C.HighlightCountChanged
// 0x000C (0x000C - 0x0000)
struct AthenaWinWidget_C_HighlightCountChanged final
{
public:
	int32                                         HighlightCount;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaWinWidget_C_HighlightCountChanged) == 0x000004, "Wrong alignment on AthenaWinWidget_C_HighlightCountChanged");
static_assert(sizeof(AthenaWinWidget_C_HighlightCountChanged) == 0x00000C, "Wrong size on AthenaWinWidget_C_HighlightCountChanged");
static_assert(offsetof(AthenaWinWidget_C_HighlightCountChanged, HighlightCount) == 0x000000, "Member 'AthenaWinWidget_C_HighlightCountChanged::HighlightCount' has a wrong offset!");
static_assert(offsetof(AthenaWinWidget_C_HighlightCountChanged, Temp_bool_Variable) == 0x000004, "Member 'AthenaWinWidget_C_HighlightCountChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaWinWidget_C_HighlightCountChanged, CallFunc_Greater_IntInt_ReturnValue) == 0x000005, "Member 'AthenaWinWidget_C_HighlightCountChanged::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaWinWidget_C_HighlightCountChanged, Temp_byte_Variable) == 0x000006, "Member 'AthenaWinWidget_C_HighlightCountChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaWinWidget_C_HighlightCountChanged, Temp_byte_Variable2) == 0x000007, "Member 'AthenaWinWidget_C_HighlightCountChanged::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaWinWidget_C_HighlightCountChanged, K2Node_Select_Default) == 0x000008, "Member 'AthenaWinWidget_C_HighlightCountChanged::K2Node_Select_Default' has a wrong offset!");

}

