#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonDirectAcquisitionScreen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSeasonDirectAcquisitionScreen.AthenaSeasonDirectAcquisitionScreen_C
// 0x0070 (0x04C0 - 0x0450)
class UAthenaSeasonDirectAcquisitionScreen_C final : public UFortDirectAcquisitionWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(Transient, DuplicateTransient)
	class UHorizontalBox*                         LargeTileHB;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NoOffersBox;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayNoOffers;                                   // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayProgressSpinner;                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerEmblemAndXp_C*                   PlayerEmblemAndXp;                                 // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressSpinner;                                   // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonDateTimeTextBlock*               SeasonCountdown;                                   // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             SmallTileGP;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  SwitcherItemsProgress;                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBOffers;                                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserWidget*                            FirstOfferGenerated;                               // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                TilePadding;                                       // 0x04B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_AthenaSeasonDirectAcquisitionScreen(int32 EntryPoint);
	void OnActivated();
	void OnOffersGenerated();
	void OnStartReadingOffers();
	void NoOffersAvailable();
	class UFortDirectAcquisitionOfferWidgetBase* GenerateOfferWidget(class FName StorefrontName, const struct FCatalogOffer& Offer, const class UFortMtxOfferData* DisplayAsset);
	void Focus();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSeasonDirectAcquisitionScreen_C">();
	}
	static class UAthenaSeasonDirectAcquisitionScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSeasonDirectAcquisitionScreen_C>();
	}
};
static_assert(alignof(UAthenaSeasonDirectAcquisitionScreen_C) == 0x000008, "Wrong alignment on UAthenaSeasonDirectAcquisitionScreen_C");
static_assert(sizeof(UAthenaSeasonDirectAcquisitionScreen_C) == 0x0004C0, "Wrong size on UAthenaSeasonDirectAcquisitionScreen_C");
static_assert(offsetof(UAthenaSeasonDirectAcquisitionScreen_C, UberGraphFrame) == 0x000450, "Member 'UAthenaSeasonDirectAcquisitionScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonDirectAcquisitionScreen_C, LargeTileHB) == 0x000458, "Member 'UAthenaSeasonDirectAcquisitionScreen_C::LargeTileHB' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonDirectAcquisitionScreen_C, NoOffersBox) == 0x000460, "Member 'UAthenaSeasonDirectAcquisitionScreen_C::NoOffersBox' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonDirectAcquisitionScreen_C, OverlayNoOffers) == 0x000468, "Member 'UAthenaSeasonDirectAcquisitionScreen_C::OverlayNoOffers' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonDirectAcquisitionScreen_C, OverlayProgressSpinner) == 0x000470, "Member 'UAthenaSeasonDirectAcquisitionScreen_C::OverlayProgressSpinner' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonDirectAcquisitionScreen_C, PlayerEmblemAndXp) == 0x000478, "Member 'UAthenaSeasonDirectAcquisitionScreen_C::PlayerEmblemAndXp' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonDirectAcquisitionScreen_C, ProgressSpinner) == 0x000480, "Member 'UAthenaSeasonDirectAcquisitionScreen_C::ProgressSpinner' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonDirectAcquisitionScreen_C, SeasonCountdown) == 0x000488, "Member 'UAthenaSeasonDirectAcquisitionScreen_C::SeasonCountdown' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonDirectAcquisitionScreen_C, SmallTileGP) == 0x000490, "Member 'UAthenaSeasonDirectAcquisitionScreen_C::SmallTileGP' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonDirectAcquisitionScreen_C, SwitcherItemsProgress) == 0x000498, "Member 'UAthenaSeasonDirectAcquisitionScreen_C::SwitcherItemsProgress' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonDirectAcquisitionScreen_C, VBOffers) == 0x0004A0, "Member 'UAthenaSeasonDirectAcquisitionScreen_C::VBOffers' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonDirectAcquisitionScreen_C, FirstOfferGenerated) == 0x0004A8, "Member 'UAthenaSeasonDirectAcquisitionScreen_C::FirstOfferGenerated' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonDirectAcquisitionScreen_C, TilePadding) == 0x0004B0, "Member 'UAthenaSeasonDirectAcquisitionScreen_C::TilePadding' has a wrong offset!");

}

