#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Pumpkin_RPG_Athena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Pumpkin_RPG_Athena.B_Prj_Pumpkin_RPG_Athena_C
// 0x0138 (0x0930 - 0x07F8)
class AB_Prj_Pumpkin_RPG_Athena_C final : public AFortProjectileBase
{
public:
	uint8                                         Pad_7F8[0x8];                                      // 0x07F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0800(0x0008)(Transient, DuplicateTransient)
	class UPostProcessComponent*                  PP_Explode;                                        // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Rocket_AudioComponent;                             // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         PPFader_PPFade_14A99C0B46B3A2B7D4B568AD470476BE;   // 0x0820(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            PPFader__Direction_14A99C0B46B3A2B7D4B568AD470476BE; // 0x0824(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_825[0x3];                                      // 0x0825(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     PPFader;                                           // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Ribbon_Trail_PSC;                                  // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Water_Explosion_PSC;                               // 0x0838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Ribbon_Trail_PS;                                   // 0x0840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Water_Explosion_PS;                                // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Explosion_Generic_PS;                              // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Explosion_Generic_PSC;                             // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Rocket_Projectile_Explosion_Sound;                 // 0x0860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StopLocation;                                      // 0x0868(0x000C)(Edit, BlueprintVisible, Net, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_874[0x4];                                      // 0x0874(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      ObjectsToTraceAgainst;                             // 0x0878(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UParticleSystem*                        Explosion_Flesh_Damage_PS;                         // 0x0888(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               StopRotZ;                                          // 0x0890(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         TrailLifetime;                                     // 0x089C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Explosion_Flesh_Damage_PSC;                        // 0x08A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Rocket_Projectile_Explosion_Water_Sound;           // 0x08A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Rocket_Projectile_InAir_Sound;                     // 0x08B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               RocketTrailPS;                                     // 0x08B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tick_Delta;                                        // 0x08C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RocketSpinRate;                                    // 0x08C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Explosion_Impact_Offset;                           // 0x08C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RocketSpin;                                        // 0x08CC(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                RocketScale;                                       // 0x08D8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TimerMaxReached_;                                  // 0x08E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E5[0x3];                                      // 0x08E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Ground_Decal;                                      // 0x08E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Ground_Decal_MID;                                  // 0x08F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Decal_Size_Max;                                    // 0x08F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Decal_Size_Min;                                    // 0x08FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DecalLocation;                                     // 0x0900(0x000C)(Edit, BlueprintVisible, Net, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_90C[0x4];                                      // 0x090C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Rocket_Trail_Template;                             // 0x0910(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              SurfaceType;                                       // 0x0918(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_919[0x7];                                      // 0x0919(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceFeedbackEffect*                   ExplosionForceFeedbackNear;                        // 0x0920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   ExplosionForceFeedbackFar;                         // 0x0928(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Prj_Pumpkin_RPG_Athena(int32 EntryPoint);
	void ReceiveDestroyed();
	void OnBounce(const struct FHitResult& Hit);
	void OnStop(const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void FuseTimerMax();
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void ReceiveTick(float DeltaSeconds);
	void PPFader__UpdateFunc();
	void PPFader__FinishedFunc();
	void UserConstructionScript();
	bool ShouldPlayPostProcess();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Pumpkin_RPG_Athena_C">();
	}
	static class AB_Prj_Pumpkin_RPG_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Pumpkin_RPG_Athena_C>();
	}
};
static_assert(alignof(AB_Prj_Pumpkin_RPG_Athena_C) == 0x000008, "Wrong alignment on AB_Prj_Pumpkin_RPG_Athena_C");
static_assert(sizeof(AB_Prj_Pumpkin_RPG_Athena_C) == 0x000930, "Wrong size on AB_Prj_Pumpkin_RPG_Athena_C");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, UberGraphFrame) == 0x000800, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, PP_Explode) == 0x000808, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::PP_Explode' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, Rocket_AudioComponent) == 0x000810, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::Rocket_AudioComponent' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, Mesh) == 0x000818, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::Mesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, PPFader_PPFade_14A99C0B46B3A2B7D4B568AD470476BE) == 0x000820, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::PPFader_PPFade_14A99C0B46B3A2B7D4B568AD470476BE' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, PPFader__Direction_14A99C0B46B3A2B7D4B568AD470476BE) == 0x000824, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::PPFader__Direction_14A99C0B46B3A2B7D4B568AD470476BE' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, PPFader) == 0x000828, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::PPFader' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, Ribbon_Trail_PSC) == 0x000830, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::Ribbon_Trail_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, Water_Explosion_PSC) == 0x000838, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::Water_Explosion_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, Ribbon_Trail_PS) == 0x000840, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::Ribbon_Trail_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, Water_Explosion_PS) == 0x000848, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::Water_Explosion_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, Explosion_Generic_PS) == 0x000850, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::Explosion_Generic_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, Explosion_Generic_PSC) == 0x000858, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::Explosion_Generic_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, Rocket_Projectile_Explosion_Sound) == 0x000860, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::Rocket_Projectile_Explosion_Sound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, StopLocation) == 0x000868, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::StopLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, ObjectsToTraceAgainst) == 0x000878, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::ObjectsToTraceAgainst' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, Explosion_Flesh_Damage_PS) == 0x000888, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::Explosion_Flesh_Damage_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, StopRotZ) == 0x000890, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::StopRotZ' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, TrailLifetime) == 0x00089C, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::TrailLifetime' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, Explosion_Flesh_Damage_PSC) == 0x0008A0, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::Explosion_Flesh_Damage_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, Rocket_Projectile_Explosion_Water_Sound) == 0x0008A8, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::Rocket_Projectile_Explosion_Water_Sound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, Rocket_Projectile_InAir_Sound) == 0x0008B0, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::Rocket_Projectile_InAir_Sound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, RocketTrailPS) == 0x0008B8, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::RocketTrailPS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, Tick_Delta) == 0x0008C0, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::Tick_Delta' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, RocketSpinRate) == 0x0008C4, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::RocketSpinRate' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, Explosion_Impact_Offset) == 0x0008C8, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::Explosion_Impact_Offset' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, RocketSpin) == 0x0008CC, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::RocketSpin' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, RocketScale) == 0x0008D8, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::RocketScale' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, TimerMaxReached_) == 0x0008E4, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::TimerMaxReached_' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, Ground_Decal) == 0x0008E8, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::Ground_Decal' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, Ground_Decal_MID) == 0x0008F0, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::Ground_Decal_MID' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, Decal_Size_Max) == 0x0008F8, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::Decal_Size_Max' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, Decal_Size_Min) == 0x0008FC, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::Decal_Size_Min' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, DecalLocation) == 0x000900, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::DecalLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, Rocket_Trail_Template) == 0x000910, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::Rocket_Trail_Template' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, SurfaceType) == 0x000918, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::SurfaceType' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, ExplosionForceFeedbackNear) == 0x000920, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::ExplosionForceFeedbackNear' has a wrong offset!");
static_assert(offsetof(AB_Prj_Pumpkin_RPG_Athena_C, ExplosionForceFeedbackFar) == 0x000928, "Member 'AB_Prj_Pumpkin_RPG_Athena_C::ExplosionForceFeedbackFar' has a wrong offset!");

}

