#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Blueprint_Paper_VIM

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Blueprint_Paper_VIM.Blueprint_Paper_VIM_C
// 0x03E8 (0x07C8 - 0x03E0)
class UBlueprint_Paper_VIM_C final : public UFortAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_985813CD40257121C24510B1EFA3045F; // 0x03E8(0x00C8)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_88B6F311437F6802F9D4E885AEBB612D; // 0x04B0(0x00C8)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_62132DD84DE9792F6948379FF19FE9B0; // 0x0578(0x00C8)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_D9C2507C414C01F7CECC0291267407DC; // 0x0640(0x00C8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_209BCB204FB8EDDD0FE0ECAF3A14490E; // 0x0708(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_EAD8434D41BA827A02AADFB11592B5F7; // 0x0750(0x0048)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose_12EF14484EC26A755A1F178B81B266BF; // 0x0798(0x0030)()

public:
	void ExecuteUbergraph_Blueprint_Paper_VIM(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Blueprint_Paper_VIM_C">();
	}
	static class UBlueprint_Paper_VIM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprint_Paper_VIM_C>();
	}
};
static_assert(alignof(UBlueprint_Paper_VIM_C) == 0x000008, "Wrong alignment on UBlueprint_Paper_VIM_C");
static_assert(sizeof(UBlueprint_Paper_VIM_C) == 0x0007C8, "Wrong size on UBlueprint_Paper_VIM_C");
static_assert(offsetof(UBlueprint_Paper_VIM_C, UberGraphFrame) == 0x0003E0, "Member 'UBlueprint_Paper_VIM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_SpringBone_985813CD40257121C24510B1EFA3045F) == 0x0003E8, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_SpringBone_985813CD40257121C24510B1EFA3045F' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_SpringBone_88B6F311437F6802F9D4E885AEBB612D) == 0x0004B0, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_SpringBone_88B6F311437F6802F9D4E885AEBB612D' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_SpringBone_62132DD84DE9792F6948379FF19FE9B0) == 0x000578, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_SpringBone_62132DD84DE9792F6948379FF19FE9B0' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_SpringBone_D9C2507C414C01F7CECC0291267407DC) == 0x000640, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_SpringBone_D9C2507C414C01F7CECC0291267407DC' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_ComponentToLocalSpace_209BCB204FB8EDDD0FE0ECAF3A14490E) == 0x000708, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_ComponentToLocalSpace_209BCB204FB8EDDD0FE0ECAF3A14490E' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_Root_EAD8434D41BA827A02AADFB11592B5F7) == 0x000750, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_Root_EAD8434D41BA827A02AADFB11592B5F7' has a wrong offset!");
static_assert(offsetof(UBlueprint_Paper_VIM_C, AnimGraphNode_MeshRefPose_12EF14484EC26A755A1F178B81B266BF) == 0x000798, "Member 'UBlueprint_Paper_VIM_C::AnimGraphNode_MeshRefPose_12EF14484EC26A755A1F178B81B266BF' has a wrong offset!");

}

