#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CampaignMapWidget

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CampaignMapWidget.CampaignMapWidget_C
// 0x0220 (0x0590 - 0x0370)
class UCampaignMapWidget_C final : public UFortCampaignMap
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UIconTextButton_C*                      BtnTest;                                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Plankerton_10_C*       CampaignMapPage_Plankerton_10;                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Plankerton_11_C*       CampaignMapPage_Plankerton_11;                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Plankerton_12_C*       CampaignMapPage_Plankerton_12;                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Plankerton_13_C*       CampaignMapPage_Plankerton_13;                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Plankerton_01_C*       CampaignMapPage_Plankerton_01;                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Plankerton_02_C*       CampaignMapPage_Plankerton_02;                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Plankerton_03_C*       CampaignMapPage_Plankerton_03;                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Plankerton_04_C*       CampaignMapPage_Plankerton_04;                     // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Plankerton_05_C*       CampaignMapPage_Plankerton_05;                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Plankerton_06_C*       CampaignMapPage_Plankerton_06;                     // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Plankerton_07_C*       CampaignMapPage_Plankerton_07;                     // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Plankerton_08_C*       CampaignMapPage_Plankerton_08;                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Plankerton_09_C*       CampaignMapPage_Plankerton_09;                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Stonewood_10_C*        CampaignMapPage_Stonewood_10;                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Stonewood_01_C*        CampaignMapPage_Stonewood_01;                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Stonewood_02_C*        CampaignMapPage_Stonewood_02;                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Stonewood_03_C*        CampaignMapPage_Stonewood_03;                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Stonewood_04_C*        CampaignMapPage_Stonewood_04;                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Stonewood_05_C*        CampaignMapPage_Stonewood_05;                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Stonewood_06_C*        CampaignMapPage_Stonewood_06;                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Stonewood_07_C*        CampaignMapPage_Stonewood_07;                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Stonewood_08_C*        CampaignMapPage_Stonewood_08;                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapPage_Stonewood_09_C*        CampaignMapPage_Stonewood_09;                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapIconTextButton_C*           CMButtonNext;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCampaignMapIconTextButton_C*           CMButtonPrevious;                                  // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilityWidget*                CVWLeft;                                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilityWidget*                CVWRight;                                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageLeftTrigger;                                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageRightTrigger;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_PowerBolt;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayLeft;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayRight;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Plankerton01;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Plankerton02;                                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Plankerton03;                                      // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Plankerton04;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Plankerton05;                                      // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Plankerton06;                                      // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Plankerton07;                                      // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Plankerton08;                                      // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Plankerton09;                                      // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Plankerton10;                                      // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Plankerton11;                                      // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Plankerton12;                                      // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Plankerton13;                                      // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Stonewood01;                                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Stonewood02;                                       // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Stonewood03;                                       // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Stonewood04;                                       // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Stonewood05;                                       // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Stonewood06;                                       // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Stonewood07;                                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Stonewood08;                                       // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Stonewood09;                                       // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProtoCampaignMapPage_C*                Stonewood10;                                       // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  SwitcherPages;                                     // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextMap;                                           // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextPage;                                          // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Txt_PowerNumber;                                   // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Txt_Recommeded;                                    // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortQuestItem*                         CurrentQuestItem;                                  // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TargetIndex;                                       // 0x0570(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_574[0x4];                                      // 0x0574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SoundCue_Woosh;                                    // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberOfStonewoodPages;                            // 0x0580(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         NumberOfPlankertonPages;                           // 0x0584(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CampaignMapWidget(int32 EntryPoint);
	void OnShowPreviousPage();
	void OnShowNextPage();
	void BndEvt__CMButtonPrevious_K2Node_ComponentBoundEvent_414_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__CMButtonNext_K2Node_ComponentBoundEvent_199_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Handle_OnQuestsUpdated();
	void Construct();
	void BndEvt__BtnTest_K2Node_ComponentBoundEvent_514_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Update();
	void Find_Active_Page();
	void SetTriggerIcon(bool PassThrough);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CampaignMapWidget_C">();
	}
	static class UCampaignMapWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCampaignMapWidget_C>();
	}
};
static_assert(alignof(UCampaignMapWidget_C) == 0x000010, "Wrong alignment on UCampaignMapWidget_C");
static_assert(sizeof(UCampaignMapWidget_C) == 0x000590, "Wrong size on UCampaignMapWidget_C");
static_assert(offsetof(UCampaignMapWidget_C, UberGraphFrame) == 0x000370, "Member 'UCampaignMapWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, BtnTest) == 0x000378, "Member 'UCampaignMapWidget_C::BtnTest' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Plankerton_10) == 0x000380, "Member 'UCampaignMapWidget_C::CampaignMapPage_Plankerton_10' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Plankerton_11) == 0x000388, "Member 'UCampaignMapWidget_C::CampaignMapPage_Plankerton_11' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Plankerton_12) == 0x000390, "Member 'UCampaignMapWidget_C::CampaignMapPage_Plankerton_12' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Plankerton_13) == 0x000398, "Member 'UCampaignMapWidget_C::CampaignMapPage_Plankerton_13' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Plankerton_01) == 0x0003A0, "Member 'UCampaignMapWidget_C::CampaignMapPage_Plankerton_01' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Plankerton_02) == 0x0003A8, "Member 'UCampaignMapWidget_C::CampaignMapPage_Plankerton_02' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Plankerton_03) == 0x0003B0, "Member 'UCampaignMapWidget_C::CampaignMapPage_Plankerton_03' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Plankerton_04) == 0x0003B8, "Member 'UCampaignMapWidget_C::CampaignMapPage_Plankerton_04' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Plankerton_05) == 0x0003C0, "Member 'UCampaignMapWidget_C::CampaignMapPage_Plankerton_05' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Plankerton_06) == 0x0003C8, "Member 'UCampaignMapWidget_C::CampaignMapPage_Plankerton_06' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Plankerton_07) == 0x0003D0, "Member 'UCampaignMapWidget_C::CampaignMapPage_Plankerton_07' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Plankerton_08) == 0x0003D8, "Member 'UCampaignMapWidget_C::CampaignMapPage_Plankerton_08' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Plankerton_09) == 0x0003E0, "Member 'UCampaignMapWidget_C::CampaignMapPage_Plankerton_09' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Stonewood_10) == 0x0003E8, "Member 'UCampaignMapWidget_C::CampaignMapPage_Stonewood_10' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Stonewood_01) == 0x0003F0, "Member 'UCampaignMapWidget_C::CampaignMapPage_Stonewood_01' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Stonewood_02) == 0x0003F8, "Member 'UCampaignMapWidget_C::CampaignMapPage_Stonewood_02' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Stonewood_03) == 0x000400, "Member 'UCampaignMapWidget_C::CampaignMapPage_Stonewood_03' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Stonewood_04) == 0x000408, "Member 'UCampaignMapWidget_C::CampaignMapPage_Stonewood_04' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Stonewood_05) == 0x000410, "Member 'UCampaignMapWidget_C::CampaignMapPage_Stonewood_05' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Stonewood_06) == 0x000418, "Member 'UCampaignMapWidget_C::CampaignMapPage_Stonewood_06' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Stonewood_07) == 0x000420, "Member 'UCampaignMapWidget_C::CampaignMapPage_Stonewood_07' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Stonewood_08) == 0x000428, "Member 'UCampaignMapWidget_C::CampaignMapPage_Stonewood_08' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CampaignMapPage_Stonewood_09) == 0x000430, "Member 'UCampaignMapWidget_C::CampaignMapPage_Stonewood_09' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CMButtonNext) == 0x000438, "Member 'UCampaignMapWidget_C::CMButtonNext' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CMButtonPrevious) == 0x000440, "Member 'UCampaignMapWidget_C::CMButtonPrevious' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CVWLeft) == 0x000448, "Member 'UCampaignMapWidget_C::CVWLeft' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CVWRight) == 0x000450, "Member 'UCampaignMapWidget_C::CVWRight' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, ImageLeftTrigger) == 0x000458, "Member 'UCampaignMapWidget_C::ImageLeftTrigger' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, ImageRightTrigger) == 0x000460, "Member 'UCampaignMapWidget_C::ImageRightTrigger' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Img_PowerBolt) == 0x000468, "Member 'UCampaignMapWidget_C::Img_PowerBolt' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, OverlayLeft) == 0x000470, "Member 'UCampaignMapWidget_C::OverlayLeft' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, OverlayRight) == 0x000478, "Member 'UCampaignMapWidget_C::OverlayRight' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Plankerton01) == 0x000480, "Member 'UCampaignMapWidget_C::Plankerton01' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Plankerton02) == 0x000488, "Member 'UCampaignMapWidget_C::Plankerton02' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Plankerton03) == 0x000490, "Member 'UCampaignMapWidget_C::Plankerton03' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Plankerton04) == 0x000498, "Member 'UCampaignMapWidget_C::Plankerton04' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Plankerton05) == 0x0004A0, "Member 'UCampaignMapWidget_C::Plankerton05' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Plankerton06) == 0x0004A8, "Member 'UCampaignMapWidget_C::Plankerton06' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Plankerton07) == 0x0004B0, "Member 'UCampaignMapWidget_C::Plankerton07' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Plankerton08) == 0x0004B8, "Member 'UCampaignMapWidget_C::Plankerton08' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Plankerton09) == 0x0004C0, "Member 'UCampaignMapWidget_C::Plankerton09' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Plankerton10) == 0x0004C8, "Member 'UCampaignMapWidget_C::Plankerton10' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Plankerton11) == 0x0004D0, "Member 'UCampaignMapWidget_C::Plankerton11' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Plankerton12) == 0x0004D8, "Member 'UCampaignMapWidget_C::Plankerton12' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Plankerton13) == 0x0004E0, "Member 'UCampaignMapWidget_C::Plankerton13' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, SafeZone_0) == 0x0004E8, "Member 'UCampaignMapWidget_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Stonewood01) == 0x0004F0, "Member 'UCampaignMapWidget_C::Stonewood01' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Stonewood02) == 0x0004F8, "Member 'UCampaignMapWidget_C::Stonewood02' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Stonewood03) == 0x000500, "Member 'UCampaignMapWidget_C::Stonewood03' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Stonewood04) == 0x000508, "Member 'UCampaignMapWidget_C::Stonewood04' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Stonewood05) == 0x000510, "Member 'UCampaignMapWidget_C::Stonewood05' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Stonewood06) == 0x000518, "Member 'UCampaignMapWidget_C::Stonewood06' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Stonewood07) == 0x000520, "Member 'UCampaignMapWidget_C::Stonewood07' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Stonewood08) == 0x000528, "Member 'UCampaignMapWidget_C::Stonewood08' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Stonewood09) == 0x000530, "Member 'UCampaignMapWidget_C::Stonewood09' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Stonewood10) == 0x000538, "Member 'UCampaignMapWidget_C::Stonewood10' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, SwitcherPages) == 0x000540, "Member 'UCampaignMapWidget_C::SwitcherPages' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, TextMap) == 0x000548, "Member 'UCampaignMapWidget_C::TextMap' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, TextPage) == 0x000550, "Member 'UCampaignMapWidget_C::TextPage' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Txt_PowerNumber) == 0x000558, "Member 'UCampaignMapWidget_C::Txt_PowerNumber' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, Txt_Recommeded) == 0x000560, "Member 'UCampaignMapWidget_C::Txt_Recommeded' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, CurrentQuestItem) == 0x000568, "Member 'UCampaignMapWidget_C::CurrentQuestItem' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, TargetIndex) == 0x000570, "Member 'UCampaignMapWidget_C::TargetIndex' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, SoundCue_Woosh) == 0x000578, "Member 'UCampaignMapWidget_C::SoundCue_Woosh' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, NumberOfStonewoodPages) == 0x000580, "Member 'UCampaignMapWidget_C::NumberOfStonewoodPages' has a wrong offset!");
static_assert(offsetof(UCampaignMapWidget_C, NumberOfPlankertonPages) == 0x000584, "Member 'UCampaignMapWidget_C::NumberOfPlankertonPages' has a wrong offset!");

}

