#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CompendiumPage

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CompendiumPage.CompendiumPage_C.ExecuteUbergraph_CompendiumPage
// 0x0004 (0x0004 - 0x0000)
struct CompendiumPage_C_ExecuteUbergraph_CompendiumPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CompendiumPage_C_ExecuteUbergraph_CompendiumPage) == 0x000004, "Wrong alignment on CompendiumPage_C_ExecuteUbergraph_CompendiumPage");
static_assert(sizeof(CompendiumPage_C_ExecuteUbergraph_CompendiumPage) == 0x000004, "Wrong size on CompendiumPage_C_ExecuteUbergraph_CompendiumPage");
static_assert(offsetof(CompendiumPage_C_ExecuteUbergraph_CompendiumPage, EntryPoint) == 0x000000, "Member 'CompendiumPage_C_ExecuteUbergraph_CompendiumPage::EntryPoint' has a wrong offset!");

// Function CompendiumPage.CompendiumPage_C.SetCompendium
// 0x0020 (0x0020 - 0x0000)
struct CompendiumPage_C_SetCompendium final
{
public:
	class UFortCompendiumItem*                    Compendium_0;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(CompendiumPage_C_SetCompendium) == 0x000008, "Wrong alignment on CompendiumPage_C_SetCompendium");
static_assert(sizeof(CompendiumPage_C_SetCompendium) == 0x000020, "Wrong size on CompendiumPage_C_SetCompendium");
static_assert(offsetof(CompendiumPage_C_SetCompendium, Compendium_0) == 0x000000, "Member 'CompendiumPage_C_SetCompendium::Compendium_0' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_SetCompendium, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'CompendiumPage_C_SetCompendium::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");

// Function CompendiumPage.CompendiumPage_C.UpdateQuests
// 0x00B0 (0x00B0 - 0x0000)
struct CompendiumPage_C_UpdateQuests final
{
public:
	bool                                          bHasQuestsToClaim;                                 // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAchievedCount_OutTotalAchievedCount;   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAchievedCount_OutTotalRequiredCount;   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCompendiumItemDefinition*          CallFunc_GetCompendiumDefinitionBP_ReturnValue;    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortQuestItem*>                 CallFunc_GetQuests_OwnedQuests;                    // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UFortQuestItemDefinition*>       CallFunc_GetQuests_UnownedQuests;                  // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	class UFortQuestItemDefinition*               CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortQuestType                                CallFunc_GetQuestType_ReturnValue;                 // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87[0x1];                                       // 0x0087(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItem*                         CallFunc_Array_Get_Item2;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortQuestState                               CallFunc_GetQuestState_ReturnValue;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItemDefinition*               CallFunc_GetQuestDefinitionBP_ReturnValue;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortQuestType                                CallFunc_GetQuestType_ReturnValue2;                // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CompendiumPage_C_UpdateQuests) == 0x000008, "Wrong alignment on CompendiumPage_C_UpdateQuests");
static_assert(sizeof(CompendiumPage_C_UpdateQuests) == 0x0000B0, "Wrong size on CompendiumPage_C_UpdateQuests");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, bHasQuestsToClaim) == 0x000000, "Member 'CompendiumPage_C_UpdateQuests::bHasQuestsToClaim' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, Temp_int_Array_Index_Variable) == 0x000004, "Member 'CompendiumPage_C_UpdateQuests::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'CompendiumPage_C_UpdateQuests::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'CompendiumPage_C_UpdateQuests::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, Temp_int_Array_Index_Variable2) == 0x000010, "Member 'CompendiumPage_C_UpdateQuests::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, Temp_byte_Variable) == 0x000014, "Member 'CompendiumPage_C_UpdateQuests::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, CallFunc_GetAchievedCount_OutTotalAchievedCount) == 0x000018, "Member 'CompendiumPage_C_UpdateQuests::CallFunc_GetAchievedCount_OutTotalAchievedCount' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, CallFunc_GetAchievedCount_OutTotalRequiredCount) == 0x00001C, "Member 'CompendiumPage_C_UpdateQuests::CallFunc_GetAchievedCount_OutTotalRequiredCount' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, Temp_int_Loop_Counter_Variable2) == 0x000020, "Member 'CompendiumPage_C_UpdateQuests::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, CallFunc_Add_IntInt_ReturnValue2) == 0x000024, "Member 'CompendiumPage_C_UpdateQuests::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, Temp_byte_Variable2) == 0x000028, "Member 'CompendiumPage_C_UpdateQuests::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, CallFunc_GetCompendiumDefinitionBP_ReturnValue) == 0x000030, "Member 'CompendiumPage_C_UpdateQuests::CallFunc_GetCompendiumDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, Temp_bool_Variable) == 0x000038, "Member 'CompendiumPage_C_UpdateQuests::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, CallFunc_GetContext_ReturnValue) == 0x000040, "Member 'CompendiumPage_C_UpdateQuests::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, CallFunc_GetQuestManager_ReturnValue) == 0x000048, "Member 'CompendiumPage_C_UpdateQuests::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, K2Node_Select_Default) == 0x000050, "Member 'CompendiumPage_C_UpdateQuests::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, CallFunc_GetQuests_OwnedQuests) == 0x000058, "Member 'CompendiumPage_C_UpdateQuests::CallFunc_GetQuests_OwnedQuests' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, CallFunc_GetQuests_UnownedQuests) == 0x000068, "Member 'CompendiumPage_C_UpdateQuests::CallFunc_GetQuests_UnownedQuests' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, CallFunc_Array_Get_Item) == 0x000078, "Member 'CompendiumPage_C_UpdateQuests::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'CompendiumPage_C_UpdateQuests::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'CompendiumPage_C_UpdateQuests::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, CallFunc_GetQuestType_ReturnValue) == 0x000085, "Member 'CompendiumPage_C_UpdateQuests::CallFunc_GetQuestType_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000086, "Member 'CompendiumPage_C_UpdateQuests::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, CallFunc_Array_Get_Item2) == 0x000088, "Member 'CompendiumPage_C_UpdateQuests::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, CallFunc_GetQuestState_ReturnValue) == 0x000090, "Member 'CompendiumPage_C_UpdateQuests::CallFunc_GetQuestState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, CallFunc_GetQuestDefinitionBP_ReturnValue) == 0x000098, "Member 'CompendiumPage_C_UpdateQuests::CallFunc_GetQuestDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, K2Node_SwitchEnum_CmpSuccess) == 0x0000A0, "Member 'CompendiumPage_C_UpdateQuests::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, CallFunc_GetQuestType_ReturnValue2) == 0x0000A1, "Member 'CompendiumPage_C_UpdateQuests::CallFunc_GetQuestType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, CallFunc_Array_Length_ReturnValue2) == 0x0000A4, "Member 'CompendiumPage_C_UpdateQuests::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x0000A8, "Member 'CompendiumPage_C_UpdateQuests::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_UpdateQuests, CallFunc_Less_IntInt_ReturnValue2) == 0x0000A9, "Member 'CompendiumPage_C_UpdateQuests::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");

// Function CompendiumPage.CompendiumPage_C.RegisterEventListeners
// 0x0020 (0x0020 - 0x0000)
struct CompendiumPage_C_RegisterEventListeners final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CompendiumPage_C_RegisterEventListeners) == 0x000008, "Wrong alignment on CompendiumPage_C_RegisterEventListeners");
static_assert(sizeof(CompendiumPage_C_RegisterEventListeners) == 0x000020, "Wrong size on CompendiumPage_C_RegisterEventListeners");
static_assert(offsetof(CompendiumPage_C_RegisterEventListeners, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'CompendiumPage_C_RegisterEventListeners::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_RegisterEventListeners, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'CompendiumPage_C_RegisterEventListeners::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_RegisterEventListeners, CallFunc_GetQuestManager_ReturnValue) == 0x000018, "Member 'CompendiumPage_C_RegisterEventListeners::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");

// Function CompendiumPage.CompendiumPage_C.CreateQuestWidget
// 0x0020 (0x0020 - 0x0000)
struct CompendiumPage_C_CreateQuestWidget final
{
public:
	class UFortQuestItem*                         Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDailyQuestWidget_C*                    CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CompendiumPage_C_CreateQuestWidget) == 0x000008, "Wrong alignment on CompendiumPage_C_CreateQuestWidget");
static_assert(sizeof(CompendiumPage_C_CreateQuestWidget) == 0x000020, "Wrong size on CompendiumPage_C_CreateQuestWidget");
static_assert(offsetof(CompendiumPage_C_CreateQuestWidget, Quest) == 0x000000, "Member 'CompendiumPage_C_CreateQuestWidget::Quest' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_CreateQuestWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'CompendiumPage_C_CreateQuestWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_CreateQuestWidget, CallFunc_Create_ReturnValue) == 0x000010, "Member 'CompendiumPage_C_CreateQuestWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_CreateQuestWidget, CallFunc_AddChild_ReturnValue) == 0x000018, "Member 'CompendiumPage_C_CreateQuestWidget::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function CompendiumPage.CompendiumPage_C.CreateDisabledQuestWidget
// 0x0020 (0x0020 - 0x0000)
struct CompendiumPage_C_CreateDisabledQuestWidget final
{
public:
	class UFortQuestItemDefinition*               QuestDefinition;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDisabledQuestWidget_C*                 CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CompendiumPage_C_CreateDisabledQuestWidget) == 0x000008, "Wrong alignment on CompendiumPage_C_CreateDisabledQuestWidget");
static_assert(sizeof(CompendiumPage_C_CreateDisabledQuestWidget) == 0x000020, "Wrong size on CompendiumPage_C_CreateDisabledQuestWidget");
static_assert(offsetof(CompendiumPage_C_CreateDisabledQuestWidget, QuestDefinition) == 0x000000, "Member 'CompendiumPage_C_CreateDisabledQuestWidget::QuestDefinition' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_CreateDisabledQuestWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'CompendiumPage_C_CreateDisabledQuestWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_CreateDisabledQuestWidget, CallFunc_Create_ReturnValue) == 0x000010, "Member 'CompendiumPage_C_CreateDisabledQuestWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CompendiumPage_C_CreateDisabledQuestWidget, CallFunc_AddChild_ReturnValue) == 0x000018, "Member 'CompendiumPage_C_CreateDisabledQuestWidget::CallFunc_AddChild_ReturnValue' has a wrong offset!");

}

