#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CompendiumUpsellPage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CompendiumUpsellPage.CompendiumUpsellPage_C
// 0x0018 (0x0248 - 0x0230)
class UCompendiumUpsellPage_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(Transient, DuplicateTransient)
	class UIconTextButton_C*                      PurchaseButton;                                    // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortCompendiumItemDefinition*          CompendiumItemDefinition;                          // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CompendiumUpsellPage(int32 EntryPoint);
	void BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_56_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void SetCompendium(class UFortCompendiumItemDefinition* CompendiumItemDefinition_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CompendiumUpsellPage_C">();
	}
	static class UCompendiumUpsellPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompendiumUpsellPage_C>();
	}
};
static_assert(alignof(UCompendiumUpsellPage_C) == 0x000008, "Wrong alignment on UCompendiumUpsellPage_C");
static_assert(sizeof(UCompendiumUpsellPage_C) == 0x000248, "Wrong size on UCompendiumUpsellPage_C");
static_assert(offsetof(UCompendiumUpsellPage_C, UberGraphFrame) == 0x000230, "Member 'UCompendiumUpsellPage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCompendiumUpsellPage_C, PurchaseButton) == 0x000238, "Member 'UCompendiumUpsellPage_C::PurchaseButton' has a wrong offset!");
static_assert(offsetof(UCompendiumUpsellPage_C, CompendiumItemDefinition) == 0x000240, "Member 'UCompendiumUpsellPage_C::CompendiumItemDefinition' has a wrong offset!");

}

