#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CompendiumBundle

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CompendiumBundle.CompendiumBundle_C
// 0x0050 (0x0470 - 0x0420)
class UCompendiumBundle_C final : public UAthenaCompendiumScreenBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(Transient, DuplicateTransient)
	class UCommonWidgetSwitcher*                  CompendiumPageSwitcher;                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalTabList_C*                   CompendiumPageTabList;                             // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortCompendiumBundle*                  CompendiumBundle;                                  // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortCompendiumItem*>            ActiveCompendiums;                                 // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UFortCompendiumItemDefinition*>  UnlockableCompendiums;                             // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FName                                   LastActiveTab;                                     // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bConstructed;                                      // 0x0468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CompendiumBundle(int32 EntryPoint);
	void OnActivated();
	void OnDeactivated();
	void BndEvt__CompendiumPageTabList_K2Node_ComponentBoundEvent_12_OnTabButtonCreated__DelegateSignature(class FName TabId, class UCommonButton* TabButton);
	void BndEvt__CompendiumPageTabList_K2Node_ComponentBoundEvent_1_OnTabSelected__DelegateSignature(class FName TabId);
	void Construct();
	void SetBundle(class UFortCompendiumBundle* CompendiumBundle_0);
	void UpdateTabs();
	void ResetTabs();
	void CreateTab(class UFortCompendiumItemDefinition* CompendiumItemDefinition, class UWidget* ContentWidget);
	void HandleTabCreated(class FName TabId, class UCommonButton* Button);
	void HandleTabSelected(class FName TabId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CompendiumBundle_C">();
	}
	static class UCompendiumBundle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompendiumBundle_C>();
	}
};
static_assert(alignof(UCompendiumBundle_C) == 0x000008, "Wrong alignment on UCompendiumBundle_C");
static_assert(sizeof(UCompendiumBundle_C) == 0x000470, "Wrong size on UCompendiumBundle_C");
static_assert(offsetof(UCompendiumBundle_C, UberGraphFrame) == 0x000420, "Member 'UCompendiumBundle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCompendiumBundle_C, CompendiumPageSwitcher) == 0x000428, "Member 'UCompendiumBundle_C::CompendiumPageSwitcher' has a wrong offset!");
static_assert(offsetof(UCompendiumBundle_C, CompendiumPageTabList) == 0x000430, "Member 'UCompendiumBundle_C::CompendiumPageTabList' has a wrong offset!");
static_assert(offsetof(UCompendiumBundle_C, CompendiumBundle) == 0x000438, "Member 'UCompendiumBundle_C::CompendiumBundle' has a wrong offset!");
static_assert(offsetof(UCompendiumBundle_C, ActiveCompendiums) == 0x000440, "Member 'UCompendiumBundle_C::ActiveCompendiums' has a wrong offset!");
static_assert(offsetof(UCompendiumBundle_C, UnlockableCompendiums) == 0x000450, "Member 'UCompendiumBundle_C::UnlockableCompendiums' has a wrong offset!");
static_assert(offsetof(UCompendiumBundle_C, LastActiveTab) == 0x000460, "Member 'UCompendiumBundle_C::LastActiveTab' has a wrong offset!");
static_assert(offsetof(UCompendiumBundle_C, bConstructed) == 0x000468, "Member 'UCompendiumBundle_C::bConstructed' has a wrong offset!");

}

