#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DisabledQuestWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DisabledQuestWidget.DisabledQuestWidget_C
// 0x0050 (0x0288 - 0x0238)
class UDisabledQuestWidget_C final : public UCommonUserWidget
{
public:
	class UDailyQuestRewardInfo_C*                DailyQuestRewardInfo;                              // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ObjectivesBox;                                     // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       QuestName;                                         // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortQuestItem*                         Quest;                                             // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortQuestObjectiveInfo*>        VisibleObjectives;                                 // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UFortQuestItemDefinition*               QuestDefinition;                                   // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               ObjectiveDefintions;                               // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortMcpQuestObjectiveInfo>     Objectives;                                        // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void SetQuestItem(class UFortQuestItemDefinition* QuestDefinition_0);
	void FilterObjectives();
	void UpdateObjectiveWidgets();
	void CreateAllObjectiveWidgets();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DisabledQuestWidget_C">();
	}
	static class UDisabledQuestWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDisabledQuestWidget_C>();
	}
};
static_assert(alignof(UDisabledQuestWidget_C) == 0x000008, "Wrong alignment on UDisabledQuestWidget_C");
static_assert(sizeof(UDisabledQuestWidget_C) == 0x000288, "Wrong size on UDisabledQuestWidget_C");
static_assert(offsetof(UDisabledQuestWidget_C, DailyQuestRewardInfo) == 0x000238, "Member 'UDisabledQuestWidget_C::DailyQuestRewardInfo' has a wrong offset!");
static_assert(offsetof(UDisabledQuestWidget_C, ObjectivesBox) == 0x000240, "Member 'UDisabledQuestWidget_C::ObjectivesBox' has a wrong offset!");
static_assert(offsetof(UDisabledQuestWidget_C, QuestName) == 0x000248, "Member 'UDisabledQuestWidget_C::QuestName' has a wrong offset!");
static_assert(offsetof(UDisabledQuestWidget_C, Quest) == 0x000250, "Member 'UDisabledQuestWidget_C::Quest' has a wrong offset!");
static_assert(offsetof(UDisabledQuestWidget_C, VisibleObjectives) == 0x000258, "Member 'UDisabledQuestWidget_C::VisibleObjectives' has a wrong offset!");
static_assert(offsetof(UDisabledQuestWidget_C, QuestDefinition) == 0x000268, "Member 'UDisabledQuestWidget_C::QuestDefinition' has a wrong offset!");
static_assert(offsetof(UDisabledQuestWidget_C, ObjectiveDefintions) == 0x000270, "Member 'UDisabledQuestWidget_C::ObjectiveDefintions' has a wrong offset!");
static_assert(offsetof(UDisabledQuestWidget_C, Objectives) == 0x000278, "Member 'UDisabledQuestWidget_C::Objectives' has a wrong offset!");

}

