#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DisabledQuestWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function DisabledQuestWidget.DisabledQuestWidget_C.SetQuestItem
// 0x0050 (0x0050 - 0x0000)
struct DisabledQuestWidget_C_SetQuestItem final
{
public:
	class UFortQuestItemDefinition*               QuestDefinition_0;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortRewardInfo                        CallFunc_GetRewardInfo_BP_ReturnValue;             // 0x0008(0x0030)()
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0038(0x0018)()
};
static_assert(alignof(DisabledQuestWidget_C_SetQuestItem) == 0x000008, "Wrong alignment on DisabledQuestWidget_C_SetQuestItem");
static_assert(sizeof(DisabledQuestWidget_C_SetQuestItem) == 0x000050, "Wrong size on DisabledQuestWidget_C_SetQuestItem");
static_assert(offsetof(DisabledQuestWidget_C_SetQuestItem, QuestDefinition_0) == 0x000000, "Member 'DisabledQuestWidget_C_SetQuestItem::QuestDefinition_0' has a wrong offset!");
static_assert(offsetof(DisabledQuestWidget_C_SetQuestItem, CallFunc_GetRewardInfo_BP_ReturnValue) == 0x000008, "Member 'DisabledQuestWidget_C_SetQuestItem::CallFunc_GetRewardInfo_BP_ReturnValue' has a wrong offset!");
static_assert(offsetof(DisabledQuestWidget_C_SetQuestItem, CallFunc_GetDisplayName_ReturnValue) == 0x000038, "Member 'DisabledQuestWidget_C_SetQuestItem::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");

// Function DisabledQuestWidget.DisabledQuestWidget_C.FilterObjectives
// 0x0130 (0x0130 - 0x0000)
struct DisabledQuestWidget_C_FilterObjectives final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortMcpQuestObjectiveInfo>     CallFunc_GetObjectives_BP_ReturnValue;             // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMcpQuestObjectiveInfo             CallFunc_Array_Get_Item;                           // 0x0028(0x00F8)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DisabledQuestWidget_C_FilterObjectives) == 0x000008, "Wrong alignment on DisabledQuestWidget_C_FilterObjectives");
static_assert(sizeof(DisabledQuestWidget_C_FilterObjectives) == 0x000130, "Wrong size on DisabledQuestWidget_C_FilterObjectives");
static_assert(offsetof(DisabledQuestWidget_C_FilterObjectives, Temp_int_Array_Index_Variable) == 0x000000, "Member 'DisabledQuestWidget_C_FilterObjectives::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DisabledQuestWidget_C_FilterObjectives, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'DisabledQuestWidget_C_FilterObjectives::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DisabledQuestWidget_C_FilterObjectives, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'DisabledQuestWidget_C_FilterObjectives::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DisabledQuestWidget_C_FilterObjectives, CallFunc_GetObjectives_BP_ReturnValue) == 0x000010, "Member 'DisabledQuestWidget_C_FilterObjectives::CallFunc_GetObjectives_BP_ReturnValue' has a wrong offset!");
static_assert(offsetof(DisabledQuestWidget_C_FilterObjectives, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'DisabledQuestWidget_C_FilterObjectives::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DisabledQuestWidget_C_FilterObjectives, CallFunc_Array_Get_Item) == 0x000028, "Member 'DisabledQuestWidget_C_FilterObjectives::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DisabledQuestWidget_C_FilterObjectives, CallFunc_Less_IntInt_ReturnValue) == 0x000120, "Member 'DisabledQuestWidget_C_FilterObjectives::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DisabledQuestWidget_C_FilterObjectives, CallFunc_Array_Add_ReturnValue) == 0x000124, "Member 'DisabledQuestWidget_C_FilterObjectives::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(DisabledQuestWidget_C_FilterObjectives, CallFunc_Not_PreBool_ReturnValue) == 0x000128, "Member 'DisabledQuestWidget_C_FilterObjectives::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function DisabledQuestWidget.DisabledQuestWidget_C.CreateAllObjectiveWidgets
// 0x0128 (0x0128 - 0x0000)
struct DisabledQuestWidget_C_CreateAllObjectiveWidgets final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMcpQuestObjectiveInfo             CallFunc_Array_Get_Item;                           // 0x0010(0x00F8)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDailyQuestObjectiveEntry_C*            CallFunc_Create_ReturnValue;                       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DisabledQuestWidget_C_CreateAllObjectiveWidgets) == 0x000008, "Wrong alignment on DisabledQuestWidget_C_CreateAllObjectiveWidgets");
static_assert(sizeof(DisabledQuestWidget_C_CreateAllObjectiveWidgets) == 0x000128, "Wrong size on DisabledQuestWidget_C_CreateAllObjectiveWidgets");
static_assert(offsetof(DisabledQuestWidget_C_CreateAllObjectiveWidgets, Temp_int_Array_Index_Variable) == 0x000000, "Member 'DisabledQuestWidget_C_CreateAllObjectiveWidgets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DisabledQuestWidget_C_CreateAllObjectiveWidgets, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'DisabledQuestWidget_C_CreateAllObjectiveWidgets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DisabledQuestWidget_C_CreateAllObjectiveWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'DisabledQuestWidget_C_CreateAllObjectiveWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DisabledQuestWidget_C_CreateAllObjectiveWidgets, CallFunc_Array_Get_Item) == 0x000010, "Member 'DisabledQuestWidget_C_CreateAllObjectiveWidgets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DisabledQuestWidget_C_CreateAllObjectiveWidgets, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'DisabledQuestWidget_C_CreateAllObjectiveWidgets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DisabledQuestWidget_C_CreateAllObjectiveWidgets, CallFunc_Less_IntInt_ReturnValue) == 0x00010C, "Member 'DisabledQuestWidget_C_CreateAllObjectiveWidgets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DisabledQuestWidget_C_CreateAllObjectiveWidgets, CallFunc_GetOwningPlayer_ReturnValue) == 0x000110, "Member 'DisabledQuestWidget_C_CreateAllObjectiveWidgets::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(DisabledQuestWidget_C_CreateAllObjectiveWidgets, CallFunc_Create_ReturnValue) == 0x000118, "Member 'DisabledQuestWidget_C_CreateAllObjectiveWidgets::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(DisabledQuestWidget_C_CreateAllObjectiveWidgets, CallFunc_AddChild_ReturnValue) == 0x000120, "Member 'DisabledQuestWidget_C_CreateAllObjectiveWidgets::CallFunc_AddChild_ReturnValue' has a wrong offset!");

}

