#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Wall_Electric_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trap_Wall_Electric_Athena.Trap_Wall_Electric_Athena_C
// 0x0080 (0x1160 - 0x10E0)
class ATrap_Wall_Electric_Athena_C final : public ABuildingTrapWall
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x10E0(0x0008)(Transient, DuplicateTransient)
	class UAudioComponent*                        ChargeSound;                                       // 0x10E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        TraceLocation;                                     // 0x10F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TriggerComponent;                                  // 0x10F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               IdleFX_Coil_R;                                     // 0x1100(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               IdleFX_Coil_L;                                     // 0x1108(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Light_onFire;                                      // 0x1110(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               IdleFX_Arcs_R;                                     // 0x1118(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               IdleFX_Arcs_L;                                     // 0x1120(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x1128(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FadeLight_Brightness_C184AADC4D731F4EF02D419DFF483ED3; // 0x1130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeLight__Direction_C184AADC4D731F4EF02D419DFF483ED3; // 0x1134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1135[0x3];                                     // 0x1135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeLight;                                         // 0x1138(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Activate_Sound_Cue;                                // 0x1140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Placed_Sound_Cue;                                  // 0x1148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Explode_Sound_Cue;                                 // 0x1150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Fire_Sound_Cue;                               // 0x1158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Trap_Wall_Electric_Athena(int32 EntryPoint);
	void OnWorldReady();
	void OnOutOfDurability();
	void GameplayCue_Abilities_Activation_Traps_ActivateTrap(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void OnReloadEnd();
	void OnFinishedBuilding();
	void OnPlaced();
	void FadeLight__UpdateFunc();
	void FadeLight__FinishedFunc();
	void UserConstructionScript();
	void PlayActivationSoundAndFX();

	struct FTransform GetFireLocationAndRotation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Wall_Electric_Athena_C">();
	}
	static class ATrap_Wall_Electric_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Wall_Electric_Athena_C>();
	}
};
static_assert(alignof(ATrap_Wall_Electric_Athena_C) == 0x000010, "Wrong alignment on ATrap_Wall_Electric_Athena_C");
static_assert(sizeof(ATrap_Wall_Electric_Athena_C) == 0x001160, "Wrong size on ATrap_Wall_Electric_Athena_C");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, UberGraphFrame) == 0x0010E0, "Member 'ATrap_Wall_Electric_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, ChargeSound) == 0x0010E8, "Member 'ATrap_Wall_Electric_Athena_C::ChargeSound' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, TraceLocation) == 0x0010F0, "Member 'ATrap_Wall_Electric_Athena_C::TraceLocation' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, TriggerComponent) == 0x0010F8, "Member 'ATrap_Wall_Electric_Athena_C::TriggerComponent' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, IdleFX_Coil_R) == 0x001100, "Member 'ATrap_Wall_Electric_Athena_C::IdleFX_Coil_R' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, IdleFX_Coil_L) == 0x001108, "Member 'ATrap_Wall_Electric_Athena_C::IdleFX_Coil_L' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, Light_onFire) == 0x001110, "Member 'ATrap_Wall_Electric_Athena_C::Light_onFire' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, IdleFX_Arcs_R) == 0x001118, "Member 'ATrap_Wall_Electric_Athena_C::IdleFX_Arcs_R' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, IdleFX_Arcs_L) == 0x001120, "Member 'ATrap_Wall_Electric_Athena_C::IdleFX_Arcs_L' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, Root) == 0x001128, "Member 'ATrap_Wall_Electric_Athena_C::Root' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, FadeLight_Brightness_C184AADC4D731F4EF02D419DFF483ED3) == 0x001130, "Member 'ATrap_Wall_Electric_Athena_C::FadeLight_Brightness_C184AADC4D731F4EF02D419DFF483ED3' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, FadeLight__Direction_C184AADC4D731F4EF02D419DFF483ED3) == 0x001134, "Member 'ATrap_Wall_Electric_Athena_C::FadeLight__Direction_C184AADC4D731F4EF02D419DFF483ED3' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, FadeLight) == 0x001138, "Member 'ATrap_Wall_Electric_Athena_C::FadeLight' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, Activate_Sound_Cue) == 0x001140, "Member 'ATrap_Wall_Electric_Athena_C::Activate_Sound_Cue' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, Placed_Sound_Cue) == 0x001148, "Member 'ATrap_Wall_Electric_Athena_C::Placed_Sound_Cue' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, Explode_Sound_Cue) == 0x001150, "Member 'ATrap_Wall_Electric_Athena_C::Explode_Sound_Cue' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, Trap_Fire_Sound_Cue) == 0x001158, "Member 'ATrap_Wall_Electric_Athena_C::Trap_Fire_Sound_Cue' has a wrong offset!");

}

